// Дан масив [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]
// Знайти кількість парних позитивних елементів. (маю на увазі - парне число ділиться на два без остачі).

let arr = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let filteredArr = arr.filter (element => element > 0);
console.log ('Відфільтрований масив тільки з позитивними елементами = ' + filteredArr);

let evenElement = filteredArr.filter (element => element % 2 == 0);
console.log ('Парні позитивні елементи = ' + evenElement);
console.log('Кількість парних позитивних елементів масиву = ' + evenElement.length);