// Дан масив [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]
// Знайти найбільший серед елементів масиву, остальні обнулити

let arr = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];

let max = arr => arr.reduce((x, y) => Math.max(x, y));
console.log ("Максимальний елемент масиву = " + max(arr));
console.log ("Порядковий номер максимального елементу масиву = " + arr.indexOf(max(arr)));

let newArr = arr.slice (18, 19);
console.log ("Новий масив за умовами завдання = " + newArr);